hm-park-dev/human-motion-capture-system/STM32/MotionCapture_BLE_Mesh/Projects/STM32L4R9ZI-SensorTile.box/Applications/Sensor_Demo/Src/appli_mesh.c
  ProvisionFlag = 0;
#ifdef STM32_SENSORTILEBOX
  BSP_LED_Off(LED_RED);  
//  BSP_LED_Off(LED_GREEN);
#else
  SetLed(0);
#endif 
}

/**
* @brief Unprovisioned Node Identification
* @param MOBLEUINT8 data 
* @retval none
*/
void Appli_BleUnprovisionedIdentifyCb(MOBLEUINT8 data)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 1;  
#endif
  TRACE_M(TF_PROVISION,"Unprovisioned Node Identifier received: %02x\n\r", data);    
}

/**
* @brief  Set Number of Elements in a Node
* @param  none
* @retval Sending the value to BLE Mesh Library
*/ 
MOBLEUINT8 Appli_BleSetNumberOfElementsCb(void)
{
  if(NumberOfElements > BluenrgMesh_GetNumberOfElements())
  {
   // TRACE_M(TF_MISC,"In version 1.11.000 one Element per node is supported!\r\n"); 
    return BluenrgMesh_GetNumberOfElements();
  }

  else if(NumberOfElements == 0)
  {
   // TRACE_M(TF_MISC, "Number Of Elements must be 1 or greater than 1!\r\n"); 
    return 1;
  }
  
  else
  {
  return NumberOfElements;
  }
}

/**
* @brief  Sets the Attention Timer Callback function
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleAttentionTimerCb(void)
{
/* avoid printf, if low power feature is supported */ 
  #if !defined(DISABLE_TRACES)
  printf("Attention timer callback received \r\n");
  #endif
  
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  Call back function to give Output OOB information 
* @param  MOBLEUINT8* output_oob
* @param  MOBLEUINT8 size
* @retval void
*/ 
void Appli_BleOutputOOBAuthCb(MOBLEUINT8* output_oob, MOBLEUINT8 size)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  uint32_t ooBData = 0;    
    for (MOBLEUINT8 i = 0; i < size; i++)
    {
        ooBData |= (output_oob[i] << 8*i);
    }
    OutputOobData = ooBData;
   // TRACE_M(TF_PROVISION,"Output OOB information for provisioner: %d\n\r", ooBData);   
#endif
}

#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
/**
* @brief  Process for both output and Input OOB handling
* @param  void
* @retval void
*/ 
void Appli_OobAuthenticationProcess(void)
{
    if(OutputOobBlinkCount < OutputOobData)
    {
      OutputOobBlinkCount++;
      Appli_LedBlink();
    }
    else
    {
        OutputOobBlinkCount++;
        Clock_Wait(1000);
        if(OutputOobBlinkCount > OutputOobData+3)
        {
            OutputOobBlinkCount = 0;
        }
    }
}
#endif

/**
* @brief  Call back function to provide Input OOB information
* @param  MOBLEUINT8 size
* @retval MOBLEUINT8*  
*/ 
MOBLEUINT8* Appli_BleInputOOBAuthCb(MOBLEUINT8 size)
{
#if defined (ENABLE_AUTH_TYPE_INPUT_OOB) && (ENABLE_SERIAL_INTERFACE)
  MOBLEUINT16 inputTimer = 0; 
  //TRACE_M(TF_PROVISION,"Input OOB information for provisioner-Size: %d\n\r", size);   
  while(1)
  {
      Serial_InterfaceProcess();
      #ifdef BLUENRG1_NWK_COPROC
      BTLE_StackTick();
      else
      HCI_Process();
      #endif
      /* Check if input is completed or timeout */
      if((inputOOBDataReady != 0x00) | (inputTimer > INPUT_OOB_TIMEOUT))
      {
          inputOOBDataReady = 0;
          break;
      }
      Clock_Wait(100);
      inputTimer++;
  }
  return InputOobData; 
#else
  return NULL;
#endif
}

/**
* @brief  Call back function to provide Input OOB information
* @param  rcvdStringBuff: buffer to store input string 
* @param  rcvdStringSize: length of the input string 
* @retval void  
*/ 
void Appli_BleSerialInputOOBValue(char *rcvdStringBuff, uint16_t rcvdStringSize)
{
#ifdef  ENABLE_AUTH_TYPE_INPUT_OOB
  unsigned long long InputOobDatatemp;
    sscanf(rcvdStringBuff + 5, "%lld", &InputOobDatatemp);
    memmove(&InputOobData, &InputOobDatatemp, sizeof(InputOobDatatemp));
    inputOOBDataReady = 1;
#endif
}

/**
* @brief  Enable Node as Sniffer to Capture all the packets
* @param  none
* @retval Sending the value to BLE Mesh Library
*/
MOBLEUINT8 Appli_BleDisableFilterCb(void)
{
    return DisableFilter;
}

/**
* @brief  Checks and do Manual Unprovision of board  
* @param  void
* @retval void
*/ 
void Appli_CheckForUnprovision(void)
{
  /* Checks if the User button is pressed or not at the startup */
  if (BUTTON_PRESSED == GetButtonState())
  {
    SetLed(1);
    tClockTime t = Clock_Time();
    int interrupted = 0;
    
    /*Wait to check if user is pressing the button persistently*/
    while ((Clock_Time() - t) < MANUAL_UNPROVISION_TIMER)
    {
      if (BUTTON_PRESSED != GetButtonState())
      {
        interrupted = 1;
        break;
      }
    }
    /*Unprovision, show that unprovisioning is completed, and 
    wait until user releases button*/
    if (!interrupted)
    {
      BluenrgMesh_Unprovision();
#if (SAVE_MODEL_STATE_NVM == 1)
      AppliNvm_ClearModelState();
#endif
      printf("Device is unprovisioned by application \r\n");
      
      t = Clock_Time();
      while ((Clock_Time() - t) < FLASH_ERASE_TIME);
      
      while (BUTTON_PRESSED == GetButtonState())
      {
        Appli_LedBlink();
      }
    }
    SetLed(0);
  }
}

/**
* @brief  Application processing 
*         This function should be called in main loop
* @param  void
* @retval void
*/ 
void Appli_Process(void)
{
  Appli_UpdateButtonState(GetButtonState() == BUTTON_PRESSED);
#ifdef ENABLE_SAVE_MODEL_STATE_NVM  
  AppliNvm_Process();
#endif
  
#ifdef STM32_SENSORTILEBOX
#if (MLC_FANMON_ENABLE == 1)
    static uint8_t vibration_state = 0;
    uint8_t BufferToWrite[256];
    int32_t BytesToWrite;
    MOBLEUINT8 elementNumber;
    MOBLE_ADDRESS publishAddress;
    static uint32_t tickStart = 0;
#endif
    
#if (FSM_FF_ENABLE == 1)  // Free Fall Alert  Node
    if(FreeFall_Timer)
    {
      if((HAL_GetTick() - tickStart) > 3000)
      {  
        publishAddress = BluenrgMesh_GetAddress();
        // Send the command to turn Off the Free Fall Alert Cube light
        Generic_PublishOff(publishAddress);
        FreeFall_Timer = 0;
       }
    }
#endif
    
    /* Machine Learning Core or Finite State Machine */
    if(SendMCL_FSM_EMB)
    {  
      SendMCL_FSM_EMB = 0;
      lsm6dsox_all_sources_t status;
      lsm6dsox_all_sources_get(&dev_lsm6dsox, &status);

      // Check if interrupt is from Machine Learning Core
      if(status.mlc1) {
          uint8_t mlc_out[8];
          /* Read interrupt source registers in interrupt mode */
          lsm6dsox_mlc_out_get(&dev_lsm6dsox, mlc_out);
      
#if (MLC_6D_ENABLE == 1) // 6DOF Node
//          elementNumber = Bluenrg_GetElementNumber();
//          publishAddress = BluenrgMesh_GetPublishAddress(elementNumber, GENERIC_MODEL_SERVER_LEVEL_MODEL_ID);
          publishAddress = BluenrgMesh_GetAddress();
          Enable_SPI_IRQ();
          switch (mlc_out[0]) {
          case 1:
                  // Send the command to turn On the 6DOF Cube light
                  Generic_PublishOn(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: X-axis pointing up\r\n");
                  break;
          case 2:
                  //Send the command to turn On the 6DOF Cube light
                  Generic_PublishOn(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: X-axis pointing down\r\n");
                  break;
          case 3:
                  //Send the command to turn On the 6DOF Cube light
                  Generic_PublishOn(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: Y-axis pointing up\r\n");
                  break;
          case 4:
                  //Send the command to turn On the 6DOF Cube light
                  Generic_PublishOn(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: Y-axis pointing down\r\n");
                  break;
          case 5:
                  //Send the command to turn Off the 6DOF Cube light
                  Generic_PublishOff(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: Z-axis pointing up\r\n");
                  break;
          case 6:
                  // Send the command to turn On the 6DOF Cube light
                  Generic_PublishOn(publishAddress);
                  BytesToWrite = sprintf((char *) BufferToWrite, "MLC: Z-axis pointing down\r\n");
                  break;
          default:
                  break;
          }

#elif MLC_FANMON_ENABLE == 1 // Smart Vibration Sensor Node
//          elementNumber = Bluenrg_GetElementNumber();
//          publishAddress = BluenrgMesh_GetPublishAddress(elementNumber, GENERIC_MODEL_SERVER_LEVEL_MODEL_ID);
          publishAddress = BluenrgMesh_GetAddress();
          
          if(mlc_out[0] == 0)
          {
              if(vibration_state != 1)
              {
                vibration_state = 1;
                BytesToWrite = sprintf((char *) BufferToWrite, "MLC: Low Vibration\r\n");
                Enable_SPI_IRQ();
                // Turn OFF the Vibration Cube light
                Generic_PublishOff(publishAddress);
              }
          }
          else{
              if(vibration_state != 2)
              {
                vibration_state = 2;
                BytesToWrite = sprintf((char *) BufferToWrite, "MLC: High Vibration\r\n");
                Enable_SPI_IRQ();
                //Turn ON the Vibration Cube light
                Generic_PublishOn(publishAddress);
              }
          }
#endif
	} // End check if interrupt is from Machine Learning Core

	// Check if interrupt is from Finite State Machine
	if(status.free_fall)
        {
#if (FSM_FF_ENABLE == 1)  //Free Fall Alert  Node
//	      events[0].event_exist = 1;
//	      events[0].event_timestamp = (uint16_t) (HAL_GetTick() >> 3);
//	      events[0].event_type = FSM_DATA_FF;
//	      events[0].event_code = 0;
            BytesToWrite = sprintf((char *) BufferToWrite, "FSM: Free Fall\r\n");
            FreeFall_Timer = 1;
            tickStart = HAL_GetTick();
//            elementNumber = Bluenrg_GetElementNumber();
//            publishAddress = BluenrgMesh_GetPublishAddress(elementNumber, GENERIC_MODEL_SERVER_LEVEL_MODEL_ID);
            publishAddress = BluenrgMesh_GetAddress();
            Enable_SPI_IRQ();
            //Send the command to turn On the Free Fall Alert Cube light
            Generic_PublishOn(publishAddress);
#endif
	}
	// End check if interrupt is from Finite State Machine
    }
#endif //STM32_SENSORTILEBOX
}


/**
* @brief  Checks and updates Mac address to generate MAC Address
* @param  void
* @retval MOBLEUINT8 sum return the sum calculated mac
*/ 
int Appli_CheckBdMacAddr(void)
{
  MOBLEUINT8 sum = 239;
  MOBLEUINT8 result = 0;
  
#ifdef EXTERNAL_MAC_ADDR_MGMT
  memcpy(bdaddr, (const MOBLEUINT8 *)_bdaddr , 7);
  bdaddr[7] = (EXTERNAL_MAC_ADDR_MGMT | EXTERNAL_MAC_TYPE);
#endif
  
#ifdef INTERNAL_UNIQUE_NUMBER_MAC
  Appli_GetMACfromUniqueNumber();
  bdaddr[7] = INTERNAL_UNIQUE_NUMBER_MAC;
#endif

  for (int i = 0; i < 6; ++i)
  {
    sum = (sum << 1) + bdaddr[i];
  }

