hm-park-dev/human-motion-capture-system/STM32/MotionCapture_BLE_Mesh/Projects/STM32L4R9ZI-SensorTile.box/Applications/Sensor_Demo/Src/appli_mesh.c
  if (sum == bdaddr[6])
  {
    result = 1;
  }

#if defined(EXTERNAL_MAC_ADDR_MGMT) && defined(EXTERNAL_MAC_IS_PUBLIC_ADDR)
   /* Do nothing for modification of 2 MSb */
#else
  bdaddr[5] |= 0xC0;    /* 2 Msb bits shall be 11b for Static Random Address */
#endif
  
#ifdef GENERATE_STATIC_RANDOM_MAC
  bdaddr[7] = GENERATE_STATIC_RANDOM_MAC;   
                      /* Do nothing for bdaddr, just pass the identification */
  result = 1;         /* This will overwrite the above for loop result, 
                          which is redundant for this case */
#endif  

  return result;
}


/**
* @brief  Reads the unique serial number of the device
* @param  void
* @retval void
*/
#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void)
{
#ifdef STM32L152xE
  /************************STM32L152RE 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FF800D0)
#define DEVICE_ID_REG1 (0x1FF800D4)
#define DEVICE_ID_REG2 (0x1FF800E4)
#endif

#ifdef STM32F401xE
  /************************STM32F401RE 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FFF7A10)
#define DEVICE_ID_REG1 (0x1FFF7A14)
#define DEVICE_ID_REG2 (0x1FFF7A18)
#endif  

#ifdef STM32L476xG    
  /************************STM32L476RG 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FFF7590)
#define DEVICE_ID_REG1 (0x1FFF7594)
#define DEVICE_ID_REG2 (0x1FFF7598)
#endif
  
#ifdef STM32L4R9xx
  /************************STM32L4R9xx 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FFF7A10) 
#define DEVICE_ID_REG1 (0x1FFF7A14) 
#define DEVICE_ID_REG2 (0x1FFF7A18) 
#endif

#ifdef STM32F303xE  
#define DEVICE_ID_REG0 (0x1FFFF7AC)
#define DEVICE_ID_REG1 (0x1FFFF7B0)
#define DEVICE_ID_REG2 (0x1FFFF7B4)
#endif  
  /*
  The unique serial number is a six bytes value generated from STM32 UID 
  stored at DEVICE_ID_REG0, DEVICE_ID_REG1 and DEVICE_ID_REG2. It is generated 
  cancating 4bytes from DEVICE_ID_REG2 and first bytes of DEVICE_ID_REG0 and 
  DEVICE_ID_REG1. Since the UID at DEVICE_ID_REG0 and 
  DEVICE_ID_REG1 could be identical for same batch samples, 
  4 bytes have been taken from DEVICE_ID_REG2
  */
  
  uint8_t i;
  uint8_t sum = 239;
  uint8_t *ls_addr;
  
  ls_addr = (uint8_t*)DEVICE_ID_REG2;
  
  for(i = 0; i < 4; i += 1) 
  {
    bdaddr[i] = *ls_addr;
    ls_addr++;
  }
  
  bdaddr[4] = *(uint8_t*)(DEVICE_ID_REG0);
  bdaddr[5] = (*(uint8_t*)(DEVICE_ID_REG1)) | 0xC0; 
  /* Static Device Address: 
  The two most significant bits 
  of the address shall be equal to 1, 
  hence ORed with 0xC0)*/
  
  for (i = 0; i < 6; ++i)
  {
    sum = (sum << 1) + bdaddr[i];
  }
  bdaddr[6] = sum;
}
#endif


/**
* @brief  callback for unprovision the node by provisioner.
* @param  status reserved for future 
* @retval void
*/
void BluenrgMesh_UnprovisionCallback(MOBLEUINT8 status)
{
  ProvisionFlag = 0; 
#ifndef STM32_SENSORTILEBOX
  printf("Device is unprovisioned by provisioner \n\r");
#endif
	HAL_Delay(1);
  HAL_NVIC_SystemReset();
  printf("Device is unprovisioned by provisioner \n\r");
#if PB_ADV_SUPPORTED
  BluenrgMesh_SetUnprovisionedDevBeaconInterval(PBADV_UNPROV_DEV_BEACON_INTERVAL);
#endif 
#if (SAVE_MODEL_STATE_NVM == 1)
  AppliNvm_ClearModelState();
#endif
}

/*----------------------------------------------------------------------------*/
/* Following Functions are ONLY required for the Embedded Provisioner --------*/
#if (defined(ENABLE_PROVISIONER_FEATURE) || defined(DYNAMIC_PROVISIONER))
/*----------------------------------------------------------------------------*/

void Appli_ProvisionerInit(void)
{
   NodeUnderProvisionParam.nodeAddress = 0; 
   NodeUnderProvisionParam.numOfElements = 0;
   NodeUnderProvisionParam.Reserved1 = 0;
   NodeUnderProvisionParam.saveToNVM = NVM_INIT;
}

/**
* @brief  Function for saving the Provisioned node address
* @param  void 
* @retval void
*/
void SaveProvisionedNodeAddress(void)
{
  NodeUnderProvisionParam.nodeAddress = NodeUnderProvisionParam.newNodeAddress;
  NodeUnderProvisionParam.numOfElements = NodeUnderProvisionParam.newNodeElements;
    
  if (NodeUnderProvisionParam.saveToNVM == NVM_SAVE_PENDING)
  {
    NodeUnderProvisionParam.saveToNVM = NVM_INIT;
    AppliPrvnNvm_SaveKeys(1);  /* This will trigger the saving in flash */
  }
}


/**
* @brief  Getting the New Node Provisioning Device Key 
* @param  void 
* @retval void
*/
MOBLEUINT8* GetNewProvNodeDevKey(void)
{
  return &NodeUnderProvisionParam.NewProvNodeDevKey[0];
}


/**
* @brief  Getting the New Node under Provisioning Application Key 
* @param  void 
* @retval void
*/
MOBLEUINT8* GetNewProvNodeAppKey(void)
{
  return &NodeUnderProvisionParam.NewProvNodeAppKey[0];
}


/**
* @brief  Function to Get the Node Address for provisioning 
* @param  void
* @retval void
*/
MOBLE_ADDRESS GetAddressToConfigure(void)
{
  return NodeUnderProvisionParam.nodeAddress;
}


/**
* @brief  Function to Get the Node Address for provisioning 
* @param  void
* @retval void
*/
MOBLE_ADDRESS GetNewAddressToProvision(void)
{
  return NodeUnderProvisionParam.nodeAddress + NodeUnderProvisionParam.numOfElements;
}


/**
* @brief  callback for getting the Node Address by provisioner & giving device key, app key & number of elements.
* @param  device key, app key & number of elements
* @retval To be assigned Node Address
*/
MOBLEUINT16 BluenrgMesh_PvnrDataInputCallback(MOBLEUINT8* devKey, 
                                              MOBLEUINT8* appKey, 
                                              MOBLEUINT8 numOfElements)
{
  MOBLE_ADDRESS newNodeAddressToProvision;
  MOBLEUINT8 *pUUID = {0};  /* Not used currently, not passed by Provisioner */
  
  /* Make a copy for DeviceKey and ApplicationKey, these are required later for 
       device configuration */
  memcpy(&NodeUnderProvisionParam.NewProvNodeDevKey[0], devKey, DEVICE_KEY_SIZE);
  memcpy(&NodeUnderProvisionParam.NewProvNodeAppKey[0], appKey, APP_KEY_SIZE);
  
  /* Print the keys for user */
  //TRACE_M(TF_PROVISION,"Device Key: ");
  for (MOBLEUINT8 count=0 ; count<DEVICE_KEY_SIZE; count++)
  {
   // TRACE_I(TF_PROVISION,"%.2x ", NodeUnderProvisionParam.NewProvNodeDevKey[count]);
  }

  //TRACE_M(TF_PROVISION,"App Key: ");
  for (MOBLEUINT8 count=0 ; count<DEVICE_KEY_SIZE; count++)
  {
  //  TRACE_I(TF_PROVISION,"%.2x ", NodeUnderProvisionParam.NewProvNodeAppKey[count]);
  }
  
  //TRACE_M(TF_PROVISION,"\r\n");
  
