hm-park-dev/human-motion-capture-system/STM32/MotionCapture_BLE_Mesh/Projects/STM32L4R9ZI-SensorTile.box/Applications/Sensor_Demo/Src/appli_mesh.c
  newNodeAddressToProvision = GetNewAddressToProvision();
  //TRACE_M(TF_PROVISION,"Node Address Assigned = %d \r\n",newNodeAddressToProvision);
  
  /* Save Dev key and number of Elements  */   
  AppliPrvnNvm_SaveData(NodeUnderProvisionParam.NewProvNodeDevKey,
                        newNodeAddressToProvision,
                        pUUID,
                        numOfElements);
  
  NodeUnderProvisionParam.saveToNVM = NVM_SAVE_PENDING;
  
  return newNodeAddressToProvision;
}


/**
* @brief  start Provisioner mode 
* @param  void
* @retval void
*/
void Appli_StartProvisionerMode(MOBLEUINT8 mode)
{
  MOBLEUINT8 prvsnrDevKey[16];
  MOBLEUINT8 PrvnDevKeyFlag = mode;
     
  /* Initializes Mesh network parameters */
  BluenrgMesh_CreateNetwork(prvsnrDevKey);
  
  /* Following functions help to Configure the Provisioner to default settings*/
  Start_SelfConfiguration();

  //TRACE_I(TF_PROVISION,"Provisioner node \r\n");
 // TRACE_I(TF_PROVISION,"Provisioner Dev Key:");
   for(MOBLEUINT8 i=0;i<16;i++)
  {
 //   TRACE_I(TF_INIT,"[%02x] ",prvsnrDevKey[i]);
  }
//  TRACE_I(TF_INIT,"\r\n"); 

  if (mode ==1)
  {
  AppliPrvnNvm_SaveProvisionerDevKey(&prvsnrDevKey[0],
                                     PROVISIONER_ROOT_ADDR_DEFAULT,
                                     &PrvnDevKeyFlag, 
                                     APPLICATION_NUMBER_OF_ELEMENTS);  
  }/* if (mode ==1) */
}


#define SELF_CONFIG_IDLE_STATE 0
#define SELF_CONFIG_INIT_STATE 1 
#define SELF_CONFIG_START_STATE 2
#define SELF_APPKEY_BIND_STATE 3
#define SELF_SUBSCRIBE_DEFAULT_STATE 4
#define SELF_PUBLISH_DEFAULT_STATE 5
uint8_t self_config_state= SELF_CONFIG_IDLE_STATE;

void Start_SelfConfiguration (void)
{
  self_config_state = SELF_CONFIG_INIT_STATE;
}

/**
* @brief  callback for getting the Node Address by provisioner & giving device key.
* @param  void
* @retval void
*/
void Appli_SelfConfigurationProcess(void)
{
  /* Following functions help to Configure the Provisioner to default settings*/
    
  switch (self_config_state)
  {
  case SELF_CONFIG_IDLE_STATE:
   /* Nothing to do, just wait*/ 
    return;
    
  case SELF_CONFIG_INIT_STATE:
     /* This state is just to make a "NVM Process" to run once, because the 
         function will exit after changing the state*/
    self_config_state = SELF_CONFIG_START_STATE;
    break;
  
  case SELF_CONFIG_START_STATE:
    ApplicationSetNodeSigModelList();
    self_config_state = SELF_APPKEY_BIND_STATE;
   break;
    
  case SELF_APPKEY_BIND_STATE:
    Appli_ConfigClient_SelfDefaultAppKeyBind();
    self_config_state = SELF_SUBSCRIBE_DEFAULT_STATE;
    break;
  
  case SELF_SUBSCRIBE_DEFAULT_STATE:
    AppliConfigClient_SelfSubscriptionSetDefault();
    self_config_state = SELF_PUBLISH_DEFAULT_STATE;
    break;

  case SELF_PUBLISH_DEFAULT_STATE:
    AppliConfigClient_SelfPublicationSetDefault();
    self_config_state = SELF_CONFIG_IDLE_STATE;
    break;
    
    
  default:
    break;
  }
}


/**
* @brief  This function returns starts the provisioning of one of the devices
* @param  unprovDeviceArray: Pointer of an array having unprovisioned device UUIDs
* @param  index: Index of the device to be provisioned
* @retval MOBLE_RESULT
*/  
MOBLE_RESULT BluenrgMesh_ProvisionDevice(neighbor_params_t *unprovDeviceArray, MOBLEUINT16 index)
{
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
    
  result = BluenrgMesh_ProvisionRemote((unprovDeviceArray+index)->uuid);

  return result;
}

/* Customized implementation for provisioning a device from mesh node - End */

/**
* @brief  Call back function called when PB-ADV link Opened  
* @param  none
* @retval none
*/ 
void BluenrgMesh_PbAdvLinkOpenCb(void)
{ 
  ProvisionFlag = 0;
  //TRACE_M(TF_PROVISION,"PB-ADV Link opened successfully \n\r");    
  SerialPrvn_ProvisioningStatusUpdateCb(MOBLE_TRUE, 0);
  /* Turn ON Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
  SdkEvalLedOn(LED2);
#endif
}


/**
* @brief  Call back function called when PB-ADV link Closed   
* @param  none
* @retval none
*/ 
void BluenrgMesh_PbAdvLinkCloseCb(void)
{
 // TRACE_M(TF_PROVISION,"PB-ADV Link Closed successfully \n\r");   
  /* Turn Off Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
  SdkEvalLedOff(LED2);
  SerialPrvn_ProvisioningStatusUpdateCb(MOBLE_FALSE, NodeUnderProvisionParam.nodeAddress);
#endif

  if (ProvisionFlag == 1)
  {
    SaveProvisionedNodeAddress();
    ProvisionFlag = 0;
    Appli_ConfigClientStartNodeConfiguration(1);
  }

}

/*----------------------------------------------------------------------------*/
/* The Embedded Provisioner specific code ends ------------------------------ */
#endif  /* (PROVISIONER_FEATURE == 1) */
/*----------------------------------------------------------------------------*/



/**
* @brief  callback for provision the node by provisioner.
* @param  void
* @retval void
*/
void BluenrgMesh_ProvisionCallback(void)
{
  ProvisionFlag = 1;
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 0;
#endif
 // TRACE_M(TF_PROVISION,"Device is provisioned by provisioner \r\n");
}


/**
* @brief  callback for friendship established by friend node
* @param  address of corresponding low power node
* @param  receive delay of low power node (unit ms)
* @param  poll timeout of low power node (unit 100ms)
* @param  number of elements of low power node
* @param  previous friend address of low power node (can be invalid address)
* @retval void
*/
void BluenrgMesh_FnFriendshipEstablishedCallback(MOBLE_ADDRESS lpnAddress,
                                                 MOBLEUINT8 lpnReceiveDelay,
                                                 MOBLEUINT32 lpnPollTimeout,
                                                 MOBLEUINT8 lpnNumElements,
                                                 MOBLE_ADDRESS lpnPrevFriendAddress)
{ 
 // TRACE_M(TF_LPN_FRND,"Friendship established. Low power node address 0x%.4X \r\n", lpnAddress);
 // TRACE_M(TF_LPN_FRND,"Low power node receive delay %dms \r\n", lpnReceiveDelay);
 // TRACE_M(TF_LPN_FRND,"Low power node poll timeout %dms \r\n", lpnPollTimeout*100);
 // TRACE_M(TF_LPN_FRND,"Low power node number of elements %d \r\n", lpnNumElements);
  if (lpnPrevFriendAddress != MOBLE_ADDRESS_UNASSIGNED)
  {
  //  TRACE_M(TF_LPN_FRND,"Low power node previous friend address 0x%.4X \r\n", lpnPrevFriendAddress);
  }
}

/**
* @brief  callback for friendship clear by friend node
* @param  reason of friendship clear
*         0: reserved,
*         1: friend request received from existing low power node (friend)
*         2: low power node poll timeout occurred
*         3: friend clear received
* @param  previous friend address of low power node (can be invalid address)
* @retval void
*/
void BluenrgMesh_FnFriendshipClearedCallback(MOBLEUINT8 reason, MOBLE_ADDRESS lpnAddress)
{
 // TRACE_M(TF_LPN_FRND,"Friendship cleared. Low power node address 0x%.4X \r\n", lpnAddress);
  
  switch(reason)
  {
  case FN_CLEARED_REPEAT_REQUEST: 
  //  TRACE_M(TF_LPN_FRND,"Reason: New friend request received from existing low power node \r\n");
    break;
  case FN_CLEARED_POLL_TIMEOUT:
   // TRACE_M(TF_LPN_FRND,"Reason: Low power node poll timeout occurred \r\n");
    break;
  case FN_CLEARED_FRIEND_CLEAR:
  //  TRACE_M(TF_LPN_FRND,"Reason: Friend clear received \r\n");
    break;
  default:
  //  TRACE_M(TF_LPN_FRND,"Reason: Invalid \r\n");
    break;
  }
}

/**
* @brief  callback for friendship established by low power node
* @param  address of corresponding friend node
* @retval void
*/
void BluenrgMesh_LpnFriendshipEstablishedCallback(MOBLE_ADDRESS fnAddress)
{
  /* Friendship established */
}

/**
* @brief  callback for friendship cleare by low power node
* @param  reason of friendship clear.
*         0: reserved
*         1: No response received from friend node
* @retval void
*/
void BluenrgMesh_LpnFriendshipClearedCallback(MOBLEUINT8 reason, MOBLE_ADDRESS fnAddress)
{ 
  //TRACE_M(TF_LPN_FRND,"Friendship cleared. Friend node address 0x%.4x \r\n", fnAddress);
  
